namespace SmartWalk
{
    public partial class MainPage : ContentPage
    {
       
        String[] mame5 =new string[] { 
        
       
        "S-1.缶詰のオイルやサラダ油で簡易的なランプをつくることができる",
        "S-2.硬い肉はコーラなどの炭酸飲料で柔らかくなる",
        "S-3.掛け布団の上に毛布をかけた方が温かい。",
        "S-4.服についたカレーの染みは天日干しをするだけでキレイに落ちる。",
        "S-5.ご飯は氷・ハチミツでいつもより美味しく炊ける"
         };
        String[] mame4 = new string[] {
        "A-1.ぬるい缶ビールや缶ジュースは、ボウルなどに氷を半分ほど入れ、その上で缶をコロコロ回すと数分でキンキンに冷える。",
        "A-2.剥がしづらいシールは、ヘアスプレーをかけて少し待つと簡単にはがすことができる。",
        "A-3.車に酔いやすい場合、イヤフォンなどで音楽を聴いていると酔いづらくなる。",
        "A-4.切れた電池は擦れば復活する",
        "A-5こびりついた油汚れはレモンで楽に落とせる"
        }; 
        String[] mame3 = new string[] {
        "B-1電話で「#7119」にかけると、救急車を呼ぶかどうか迷った時に対応してくれる所にかかる。",
        "B-2エアコンの室外機を日光に当たらないようにするだけで電気代を節約することができる。",
        "B-3.歯を磨くとき、歯ブラシは濡らさない方がより綺麗に磨ける",
        "B-4.ジャイアンの名言「おまえの物はおれの物、おれの物もおれの物」はイギリスのことわざ。",
        "B-5.カメハメハ大王のカメハメハは「孤独な人」という意味" };
        String[] mame2 = new string[]{
        "C-1.「のりたま」にはこしあんが入っている。",
        "C-2.現在の日本では、馬で公道を走ることができる。",
        "C-3.紙幣と硬貨は発行元が違う。",
        "C-4.サイコロは６面それぞれの穴の数によって重量に誤差が出る為、出る目の確率は均等ではない。※一番出やすい目の数は５だと言われている。",
        "C-5.スイカは腐ると爆発する。"
        };
        String[] mame1 = new string[]{
        "D-1.人の首を切り落とし、頭をボールの代わりに蹴って遊んでいたのがサッカーの始まり。",
        "D-2.思うつぼ」の壺は、博打でサイコロを振るときに使う壺のこと",
        "D-3.スマホにおしりふきのカバーを張り付けると小銭入れになる",
        "D-4.排水溝の汚れを取りたいときは、酸性の汚れを取る重曹で擦る次にアルカリ性の汚れを取るクエン酸を混ぜ合わせることで二酸化炭素が発生する。",
        "D-5.右足をだし左足をだすを繰り返すと歩ける。さらに、速度をあげると走れる"
         };

        String shutoku = "";


        public MainPage()
        {
            InitializeComponent();
        }

        private void smartClicked(object sender, EventArgs e)
        {
         

           
        }
        private void luckyClicked(object sender, EventArgs e)
        {

        }
    }

}
